src/DataProcessors/МастерПроверкиИЗаполненияПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>МастерПроверкиИЗаполненияПланов</Name>
			<Comment>Мастер проверки и заполнения планов</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>Периодичность планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата конца</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыПланов</Name>
					<Comment>Виды планов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Comment>Вид плана</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Светофор</Name>
							<Comment>Светофор</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеПланов</Name>
					<Comment>Заполнение планов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Comment>Вид плана</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектПланирования</Name>
							<Comment>Объект планирования</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Светофор</Name>
							<Comment>Светофор</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПлана</Name>
							<Comment>Документ плана</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланФакт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеФактов</Name>
					<Comment>Заполнение фактов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Comment>Вид плана</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектПланирования</Name>
							<Comment>Объект планирования</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Светофор</Name>
							<Comment>Светофор</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументФакта</Name>
							<Comment>Документ факта</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланФакт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Documents/ПланФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПланФакт</Name>
			<Comment>План / факт</Comment>
			<BasedOn>
				<xr:Item>Document.ПланФакт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.Планирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Comment>Вид плана</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектПланирования</Name>
					<Comment>Объект планирования</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланФакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитикиПланирования1</Name>
							<Comment>Вид аналитики планирования 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитикиПланирования2</Name>
							<Comment>Вид аналитики планирования 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитическиеРазрезыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана1</Name>
							<Comment>Показатель плана 1</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана2</Name>
							<Comment>Показатель плана 2</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПлана3</Name>
							<Comment>Показатель плана 3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПлана</Name>
					<Comment>Параметры плана</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыПланирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/МастерПроверкиИЗаполненияПланов/Ext/ObjectModule.bsl
// Модуль обработки

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Устанавливаются светофоры видов планов.
Функция УстановкаСветофоровВидаПланов(СтрокаПлана) Экспорт
	Если НЕ ЗначениеЗаполнено(СтрокаПлана) Тогда
		Возврат 0;
	КонецЕсли;
	НайденноеПодразделение = СтрокаПлана.Подразделения.Выгрузить().Найти(Подразделение);
	Если НайденноеПодразделение = Неопределено Тогда
		// Нет плана, нет факта.
		ВывестиСообщение(НСтр("ru = 'Вид плана'") + " "+СтрокаПлана+" " + НСтр("ru ='не рассчитан на работу с подразделением'")+" "
								+Подразделение+".");
		Возврат 19;
	КонецЕсли;
	Если ((ДатаНачала+(60*60*24*НайденноеПодразделение.ОтсрочкаПлана) > ДатаКонца) 
		ИЛИ (ДатаНачала+(60*60*24*НайденноеПодразделение.ОтсрочкаФакта) > ДатаКонца)) Тогда
		// Отсрочка плана или факта.
		Возврат 22;
	КонецЕсли;
	ЗаполняетсяЧастично = Истина;
	Если СтрокаПлана.ОтчетыИОбработки.Выгрузить().Найти(Истина,"ФлагЗаполненияПлана") <> Неопределено Тогда
		Если СтрокаПлана.ОтчетыИОбработки.Выгрузить().Найти(Истина,"ФлагЗаполненияФакта") <> Неопределено Тогда
			ЗаполняетсяЧастично = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ЗаполняетсяЧастично = Истина Тогда
		// Заполняется или план или факт.
		Возврат 20;
	КонецЕсли;
	// Все есть и план и факт.
	Возврат 21;
КонецФункции

// Найти/создать документ
Процедура НайтиСоздатьДокумент(ДатаНачала,ДатаКонца,Название,СтрокаВидаПлана)
	// Поищем документ
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	План.Ссылка КАК ДокументПлан,
		|	План.Проведен КАК ДокументПроведен
		|ИЗ
		|	Документ.ПланФакт КАК План
		|
		|ГДЕ
		|	План.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И План.ДатаНачала = &ДатаНачала
		|	И План.ДатаКонца = &ДатаКонца
		|	И План.ВидПлана = &ВидПлана
		|	И План.ХозОперация = &ХозОперация
		|	И План.ПометкаУдаления = ЛОЖЬ
		|");
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца",ДатаКонца);
	Запрос.УстановитьПараметр("ВидПлана",СтрокаВидаПлана.ВидПлана);
	Если Название="План" Тогда
		Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.План);
	Иначе
		Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.Факт);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()=0 Тогда
		Если Название="План" Тогда
			СтрокаЗаполнениеПланов = ЗаполнениеПланов.Добавить();
		Иначе
			СтрокаЗаполнениеПланов = ЗаполнениеФактов.Добавить();
		КонецЕсли;
		СтрокаЗаполнениеПланов.ВидПлана = СтрокаВидаПлана.ВидПлана;;
		СтрокаЗаполнениеПланов.ОбъектПланирования = СтрокаВидаПлана.ВидПлана.ВидОбъектаПланирования;
		СтрокаЗаполнениеПланов.Светофор = 19;
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		// Пишем документы в табличную часть
		Если Название="План" Тогда
			СтрокаЗаполнениеПланов = ЗаполнениеПланов.Добавить();
			СтрокаЗаполнениеПланов.ДокументПлана = Выборка.ДокументПлан;
		Иначе
			СтрокаЗаполнениеПланов = ЗаполнениеФактов.Добавить();
			СтрокаЗаполнениеПланов.ДокументФакта = Выборка.ДокументПлан;
		КонецЕсли;
		СтрокаЗаполнениеПланов.ВидПлана = Выборка.ДокументПлан.ВидПлана;
		СтрокаЗаполнениеПланов.ОбъектПланирования = Выборка.ДокументПлан.ОбъектПланирования;
		Если Выборка.ДокументПроведен Тогда
			СтрокаЗаполнениеПланов.Светофор = 21;
		Иначе
			СтрокаЗаполнениеПланов.Светофор = 20;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Автоматическое формирование плана
Процедура АвтоФормированиеПлана(ДатаНачала,ДатаКонца) Экспорт
	Для Каждого СтрокаВидаПлана Из ВидыПланов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаВидаПлана.ВидПлана) ИЛИ (СтрокаВидаПлана.Светофор=19) Тогда
			Продолжить;
		КонецЕсли;
		// Есть ли обработка заполнения плана
		Если СтрокаВидаПлана.ВидПлана.ОтчетыИОбработки.Выгрузить().Найти(Истина,"ФлагЗаполненияПлана") <> Неопределено Тогда
			НайтиСоздатьДокумент(ДатаНачала,ДатаКонца,"План",СтрокаВидаПлана);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Автоматическое формирование факта
Процедура АвтоФормированиеФакта(ДатаНачала,ДатаКонца) Экспорт
	Для Каждого СтрокаВидаПлана Из ВидыПланов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаВидаПлана.ВидПлана) ИЛИ (СтрокаВидаПлана.Светофор=19) Тогда
			Продолжить;
		КонецЕсли;
		// Есть ли обработка заполнения плана
		Если СтрокаВидаПлана.ВидПлана.ОтчетыИОбработки.Выгрузить().Найти(Истина,"ФлагЗаполненияФакта") <> Неопределено Тогда
			НайтиСоздатьДокумент(ДатаНачала,ДатаКонца,"Факт",СтрокаВидаПлана);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Заполнение видов плана
Процедура ЗаполнитьВидыПланов() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВидыПлановКомпанииПодразделения.Подразделение,
		|	ВидыПлановКомпании.Ссылка
		|ИЗ
		|	Справочник.ВидыПлановКомпании.Подразделения КАК ВидыПлановКомпанииПодразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыПлановКомпании КАК ВидыПлановКомпании
		|		ПО ВидыПлановКомпанииПодразделения.Ссылка = ВидыПлановКомпании.Ссылка
		|ГДЕ
		|	ВидыПлановКомпанииПодразделения.Подразделение = &ПодразделениеКомпании");
		
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаВидовПланов=ВидыПланов.Добавить();
		СтрокаВидовПланов.ВидПлана=Выборка.Ссылка;
		СтрокаВидовПланов.Светофор=УстановкаСветофоровВидаПланов(Выборка.Ссылка)
	КонецЦикла;
КонецПроцедуры

// Открытие документа
Процедура ОткрытьДокумент(ВидДокумента) Экспорт
	Если ВидДокумента="План" Тогда
		Для ПеременнаяЦикла=0 По ЗаполнениеПланов.Количество()-1 Цикл
			СтрокаДокумента=ЗаполнениеПланов.Получить(ПеременнаяЦикла);
			Если НЕ ЗначениеЗаполнено(СтрокаДокумента.ДокументПлана) Тогда
				СтрокаДокумента.Светофор=20;
				ДокументПланФакт = Документы.ПланФакт;
				ДокументПланФакт = ДокументПланФакт.СоздатьДокумент();
				ДокументПланФакт.Автор = ПараметрыСеанса.ТекущийПользователь;
				ДокументПланФакт.Дата = ДатаНачала;
				ДокументПланФакт.Организация = Подразделение.Организация;
				ДокументПланФакт.ПодразделениеКомпании = Подразделение;
				ДокументПланФакт.ХозОперация = Справочники.ХозОперации.План;
				ДокументПланФакт.ВидПлана = СтрокаДокумента.ВидПлана;
				ДокументПланФакт.ОбъектПланирования = СтрокаДокумента.ВидПлана.ВидОбъектаПланирования;
				ДокументПланФакт.ДатаНачала = ДатаНачала;
				ДокументПланФакт.ДатаКонца = ДатаКонца;
				ДокументПланФакт.Записать(РежимЗаписиДокумента.Запись);
				СтрокаДокумента.ДокументПлана = ДокументПланФакт.Ссылка;
				Форма=СтрокаДокумента.ДокументПлана.ПолучитьФорму("ФормаДокумента");
				Форма.Открыть();
				Возврат;
			ИначеЕсли СтрокаДокумента.Светофор <> 21 Тогда
				Форма=СтрокаДокумента.ДокументПлана.ПолучитьФорму("ФормаДокумента");
				Форма.Открыть();
				Возврат;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для ПеременнаяЦикла=0 По ЗаполнениеФактов.Количество()-1 Цикл
			СтрокаДокумента=ЗаполнениеФактов.Получить(ПеременнаяЦикла);
			Если НЕ ЗначениеЗаполнено(СтрокаДокумента.ДокументФакта) Тогда
				СтрокаДокумента.Светофор=20;
				ДокументПланФакт = Документы.ПланФакт;
				ДокументПланФакт = ДокументПланФакт.СоздатьДокумент();
				ДокументПланФакт.Автор = ПараметрыСеанса.ТекущийПользователь;
				ДокументПланФакт.Дата = ДатаНачала;
				ДокументПланФакт.Организация = Подразделение.Организация;
				ДокументПланФакт.ПодразделениеКомпании = Подразделение;
				ДокументПланФакт.ХозОперация = Справочники.ХозОперации.Факт;
				ДокументПланФакт.ВидПлана = СтрокаДокумента.ВидПлана;
				ДокументПланФакт.ОбъектПланирования = СтрокаДокумента.ВидПлана.ВидОбъектаПланирования;
				ДокументПланФакт.ДатаНачала = ДатаНачала;
				ДокументПланФакт.ДатаКонца = ДатаКонца;
				ДокументПланФакт.Записать(РежимЗаписиДокумента.Запись);
				СтрокаДокумента.ДокументФакта = ДокументПланФакт.Ссылка;
				Форма=СтрокаДокумента.ДокументФакта.ПолучитьФорму("ФормаДокумента");
				Форма.Открыть();
				Возврат;
			ИначеЕсли СтрокаДокумента.Светофор<>21 Тогда
				Форма=СтрокаДокумента.ДокументФакта.ПолучитьФорму("ФормаДокумента");
				Форма.Открыть();
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
